Table of Contents
 Class MatReinforcementEc2
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material reinforcement Ec2
[OpenModelClass("CI.StructModel.Libraries.Material.ECEN.MatReinforcementECEN,CI.Material", "CI.StructModel.Libraries.Material.IMatReinforcement,CI.BasicTypes", typeof(MatReinforcement))]
public class MatReinforcementEc2 : MatReinforcement
Inheritance
object
OpenObject
OpenElementId
Material
MatReinforcement
MatReinforcementEc2
Inherited Members
 MatReinforcement.BarSurface
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Examples
This sample shows how to create reinforcement material.
//Creating the model
OpenModel openModel = new OpenModel();
//Reinforcement material
MatReinforcementEc2 matR = new MatReinforcementEc2();
matR.Name = "Reinf";
matR.UnitMass = 7850.0;
matR.E = 200e9;
matR.Poisson = 0.2;
matR.G = 83.333e9;
matR.SpecificHeat = 0.6;
matR.ThermalExpansion = 0.00001;
matR.ThermalConductivity = 45;
matR.BarSurface = ReinfBarSurface.Ribbed;
matR.Fyk = 387e6;
matR.CoeffFtkByFyk = 1.05;
matR.Epsuk = 0.025;
matR.Class = ReinfClass.A;
matR.Type = ReinfType.Bars;
matR.Fabrication = ReinfFabrication.HotRolled;
matR.DiagramType = ReinfDiagramType.BilinerWithAnInclinedTopBranch;
//Setting thermal characteristcs of material (in this case by the code)
matR.StateOfThermalConductivity = ThermalConductivityState.Code;
matR.StateOfThermalExpansion = ThermalExpansionState.Code;
matR.StateOfThermalSpecificHeat = ThermalSpecificHeatState.Code;
matR.StateOfThermalStressStrain = ThermalStressStrainState.Code;
openModel.AddObject(matR);
Properties
 Class
Class of reinforcement
public ReinfClass Class { get; set; }
Property Value
ReinfClass
 CoeffFtkByFyk
Coefficient ftk/fyk - k
public double CoeffFtkByFyk { get; set; }
Property Value
double
 DiagramType
Type of material diagram
public ReinfDiagramType DiagramType { get; set; }
Property Value
ReinfDiagramType
 Epsuk
Characteristic strain of reinforcement at maximum load - εuk
public double Epsuk { get; set; }
Property Value
double
 Fabrication
Fabrication of reinforcement
public ReinfFabrication Fabrication { get; set; }
Property Value
ReinfFabrication
 Ftk
Characteristic tensile strength of reinforcement - ftk
public double Ftk { get; set; }
Property Value
double
 Fyk
Characteristic yield strength of reinforcement - fyk
public double Fyk { get; set; }
Property Value
double
 Type
Type of reinforcement
public ReinfType Type { get; set; }
Property Value
ReinfType
 UserDiagram
Stress-strain diagram defined by user
public Polygon2D UserDiagram { get; set; }
Property Value
Polygon2D
 Edit this page